class data_for_fill{

  static List<kartinka_data> data = [

    kartinka_data("Маргарита",
    "Это классический вариант итальянской пиццы на тонком тесте с минимальным набором ингредиентов. В её состав входят томаты, моцарелла, базилик и оливковое масло. На торжестве в честь дня рождения королевы Италии Маргариты Савойской, была подана пицца в виде итальянского флага. Королева оценила оригинальность своих поваров, и повелела назвать эту пиццу в честь себя. Так и повелось.", 
    'assets/images/ma.png', 200, 200),

    kartinka_data("Неаполитанская",
     "В составе настоящей неаполитанской пиццы ты не встретишь ничего, кроме традиционного сыра пармезан, томатов, орегано, анчоусов, оливкового масла и базилика. Некоторые пиццерии добавляют туда консервированную рыбу, но это уже отступление от классического рецепта. А еще настоящую «Неаполитано» готовят на дровах.",
     'assets/images/neap.jpg', 200, 200),

    kartinka_data("Четыре сыра", 
    "Настоящий праздник для любителей сыров. Насыщенный вкус этой пицце придают 4 разных сорта сыра, входящие в начинку. Для приготовления пиццы «Четыре сыра» используют: моцареллу, пармезан, сыр фонтина  и пикантный дор-блю.", 
    'assets/images/chsira.jpg', 200, 200),

    kartinka_data("Капричоза", 
    "В составе пиццы: артишоки, чёрные оливки и грибы, а также томаты и сыр. Эта пицца отлично подойдет для вегетарианцев, она очень вкусная и сытная, благодаря сочетанию грибов и томатов.",
    'assets/images/kap.jpg', 200, 200),

    kartinka_data("Сицилийская",
    "Отличается квадратной формой и толстой основой. Название говорит само за себя о ее происхождении, в качестве начинки выступают анчоусы, а вот сыр кладут под соус.", 
    'assets/images/sicilia.jpg', 200, 200),

    kartinka_data("Маринара",
    "Хотя в названии и явно присутствует морская тема, морепродуктов в этой пицце нет. «Маринара» это соус, который состоит из помидоров, лука, чеснока и пряных трав.",
    'assets/images/marinara.jpg', 200, 200),

    kartinka_data("Гавайская",
    "Основа начинки этого вида: ананасы и ветчина. Американцы добавляют красный лук, зеленый перец или халапеньо.",
    'assets/images/gavai.jpg', 200, 200),

    kartinka_data("Диабло", 
    "Вариант для тех, кто любит поострее. Родина этой пиццы — Калабрия. В составе острый калабрийский перец, сыры моцарелла и пармезан, салями и шампиньоны.", 
    'assets/images/diablo.jpg', 200, 200),

    kartinka_data("Четыре сезона",
    "Идея создания этой пиццы пришла в голову повару, который решил собрать на одной лепешке побольше своих любимых ингредиентов: томаты, морепродукты, грибы и ветчину. Но он не хотел хаотично смешивать все продукты, и нашел оригинальное решение — разделить лепешку на 4 сектора, вроде как времена года на календаре.", 
    'assets/images/fourseasons.jpg', 200, 200),

    kartinka_data("Регина", 
    "Впервые была создана в Новой Англии, где позже образовалась известная на весь мир сеть пиццерий Regina. В ее состав входят помидоры, моцарелла, шампиньоны, ветчина, орегано и черные оливки.", 
    'assets/images/reg.jpg', 200, 200),

    kartinka_data("Кальцоне",
    "Особенность Кальцоне в том, что это закрытая пицца, которая печется в форме полумесяца. Она похожа на пирог, а в качестве начинки в ней используется рикотта, ветчина, грибы, моцарелла, пармезан и орегано.", 
    'assets/images/kalc.jpg', 200, 200),

    kartinka_data("Греческая", 
    "Для этого вида пиццы характерно толстое тесто на лепешке. В составе греческой пиццы сыр фета, маслины, орегано.", 
    'assets/images/greka.jpg', 200, 200),

    kartinka_data("Чикагская",
     "Эта пицца родом из Чикаго печется в глубокой сковороде, за счет чего имеет высокие края. И готовится она как пицца наоборот. Если в классическом варианте томаты кладутся на лепешку, то здесь ингредиенты выкладываются в обратном порядке: моцарелла, начинка на выбор, пармезан, томатный соус с пряными травами.",
     'assets/images/chicago.jpg', 200, 200),

    kartinka_data("Бруклинская",
    "Имеет пышные, воздушные бортики с тонким центром и разнообразные варианты начинок: любые виды мяса и колбасы, различные сыры и овощи.", 
    'assets/images/brooklin.jpg', 200, 200),

    kartinka_data("Кон ле коцце",
    "Пицца для любителей морепродуктов. Центральным ингредиентом являются мидии, петрушка, оливковое масло и чеснок. А вот традиционного для пиццы сыра здесь нет.", 
    'assets/images/konliko.jpg', 200, 200),

    kartinka_data("Нью-йоркская",
    "Эта американская пицца готовится при несколько более низкой температуре, за счет чего имеет тонкую и хрустящую корочку. А начинка более чем проста: томатный соус и моцарелла.",
    'assets/images/newy.jpg', 200, 200),

    kartinka_data("Карбонара", 
    "Ее особенностью является сливочный соус, который готовится на основе сырых яиц, сливок, двух видов сыров и специй. В начинку входят жареные яйца и бекон.",
    'assets/images/karb.jpeg', 200, 200),

    kartinka_data("Эмилиана",
    "Сочетание тонко нарезанного прошутто крудо, свежей рукколы и пармезана дает почувствовать настоящий вкус Италии. В составе начинки также присутствует томатный соус и моцарелла.",
    'assets/images/em.jpg', 200, 200),

    kartinka_data("Тирольская", 
    "Пицца на тонком тесте с хрустящей корочкой, щедро пропитанная томатным соусом. В начинке: подкопчённая ветчина, оливки, пармезан, томаты.",
    'assets/images/tir.jpg', 200, 200),

    kartinka_data("Пепперони",
    "Родина этого вида пиццы север Италии. В основе начинки лежит острая одноименная салями, ветчина прошутто или хамон, моцарелла и томатный соус.",
    'assets/images/pepe.jpg', 200, 200),
  ];
}

class kartinka_data{

  String title = "";
  String text = "";
  String pictureName = "";
  double height = 200;
  double width = 200;

  kartinka_data(this.title, this.text, this.pictureName, this.height, this.width);
}